OSMICardsTo1Ci/src/Catalogs/ОСМИ_НастройкаСобытий/ОСМИ_НастройкаСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_НастройкаСобытий</name>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеОсновногоОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаДляПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ОСМИ_Действие</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРассылки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OSMICardsTo1Ci/src/Catalogs/ОСМИ_НастройкаСобытий/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОбновитьОтображение()
	ЭтаФорма.Элементы.ГруппаОбъектМетаданных.Доступность = (Объект.СпособПолученияДанных = 0);	
	
	ЭтаФорма.Элементы.ОбъектКонфигурации.СписокВыбора.Очистить();
	
	Массив = ПолучитьССервера(Объект.СпособПолученияДанных);
	
	ЭтаФорма.Элементы.ОбъектКонфигурации.СписокВыбора.ЗагрузитьЗначения(Массив);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьССервера(СпособПолучения)
	МассивКлассовМетаданных = Новый Массив;
	
	МТД = новый Массив;
	
	
	Если СпособПолучения = 0 Тогда
		МассивКлассовМетаданных.Добавить("Справочники");
		МассивКлассовМетаданных.Добавить("Документы");
	ИначеЕсли СпособПолучения = 1 Тогда
		МассивКлассовМетаданных.Добавить("РегистрыСведений");
	ИначеЕсли СпособПолучения = 2 Тогда	
		МассивКлассовМетаданных.Добавить("РегистрыНакопления");
	иначе
		
	КонецЕсли;
	
	Для каждого КлассМетаданных Из МассивКлассовМетаданных Цикл 	
		Для Каждого ОбъектМетаданных Из Метаданные[КлассМетаданных] Цикл
			МТД.Добавить(ОбъектМетаданных.ПолноеИмя());
		КонецЦикла;
	КонецЦикла;
	
	Возврат МТД;
КонецФункции

&НаКлиенте
Процедура СпособПолученияДанныхПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКод()
	Текст = 
	"ВЫБРАТЬ Таблица.$ИмяПоля$ ИЗ $ИмяТаблицы$ КАК Таблица Где $УсловияЗапроса$";
	
	УсловияЗапроса = "Истина и";
	ПараметрыЗапроса = "";
	
	
	Для Каждого Элем из Объект.Отборы Цикл
		УсловияЗапроса =УсловияЗапроса + " Таблица." + Элем.Параметр + " = &" + Элем.Параметр + " и";
		
		ПараметрыЗапроса = 
		ПараметрыЗапроса 
		+ "Запрос.УстановитьПараметр("""+Элем.Параметр 
		+ """,Отборы.Получить("+(Элем.НомерСтроки-1)+").Значение);";   
	КонецЦикла;
	
	УсловияЗапроса = Лев(УсловияЗапроса,СтрДлина(УсловияЗапроса)-1);
	
	Текст = СтрЗаменить(Текст,"$ИмяПоля$",Объект.Поле);
	Текст = СтрЗаменить(Текст,"$ИмяТаблицы$",Объект.ОбъектКонфигурации);
	Текст = СтрЗаменить(Текст,"$УсловияЗапроса$",УсловияЗапроса);
	
	Текст = 
	"	Запрос = Новый Запрос;
	|	Запрос.Текст = """+Текст+""";
	|   Запрос.УстановитьПараметр(""Источник"",Источник); 
	|	" + ПараметрыЗапроса + " 
	|   Выборка = Запрос.выполнить().выбрать();
	|   Массив = Новый Массив;
	|
	|	Пока Выборка.Следующий() Цикл
	|   	Массив.Добавить(Выборка."+Объект.Поле+");
	|   КонецЦикла;
	|	Результат = Массив;";
	
	Объект.ТекстПрограммы = Текст;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКодКоманда(Команда)
	ОбновитьКод()
КонецПроцедуры

&НаСервере
Функция СоздатьРегламентноеЗаданиеНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	
	Отбор = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные",      Метаданные.РегламентныеЗадания.ОСМИ_РегламентноеЗадание);
	Отбор.Вставить("Предопределенное",Ложь);
	Отбор.Вставить("Ключ",Об.Ссылка.УникальныйИдентификатор());
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(отбор);
	
	Если Задания.Количество() > 0 тогда
		Задание = Задания[0];
	Иначе
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ОСМИ_РегламентноеЗадание);
		Задание.Параметры.Добавить(Об.Ссылка);
		Задание.Ключ = Об.Ссылка.УникальныйИдентификатор();	
		Задание.Использование = Истина;
		Задание.Наименование = Об.Наименование;
		Задание.Записать();
		
		//Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Задание.Расписание);  		
		//Диалог.Показать() 		
	КонецЕсли;
	
	Возврат Задание.Расписание;
КонецФункции

&НаКлиенте
Процедура СоздатьРегламентноеЗадание(Команда)
	Расписание = СоздатьРегламентноеЗаданиеНаСервере();
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);  		
	
	Оповещение = Новый ОписаниеОповещения("УстановитьРасписание",ЭтотОбъект); 
	
	Диалог.Показать(Оповещение); 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасписание(РАсписание,Параметры) Экспорт
	УстановитьРасписаниеНаСервере(Расписание);
КонецПроцедуры

&НаСервере
Процедура УстановитьРасписаниеНаСервере(Расписание) Экспорт
	Об = РеквизитФормыВЗначение("Объект");
	
	Отбор = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные",      Метаданные.РегламентныеЗадания.ОСМИ_РегламентноеЗадание);
	Отбор.Вставить("Предопределенное",Ложь);
	Отбор.Вставить("Ключ",Об.Ссылка.УникальныйИдентификатор());
	Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(отбор);
	
	Если Задания.Количество() > 0 тогда
		Задание = Задания[0];
		Задание.Расписание = РАсписание;
		Задание.Записать();		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьСейчасНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ОтработатьСобытие("РегламентноеЗадание"); 
	//ОСМИ Сделать 12.09.2016
	// 
	//	Добавить форму выбора
	//
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
	ВыполнитьСейчасНаСервере();
КонецПроцедуры
